//
//  Constant.swift
//  Qapple
//
//  Created by 김민준 on 1/20/25.
//

import Foundation

enum Constant {
    static let appleId = "6480340462"
    static let academyEmail = "@pos.idserve.net"
    static let termsSummary = """
                        캐플은 모든 사용자가 안전하고 쾌적한 환경에서 활동할 수 있도록 불쾌한 콘텐츠 및 악의적인 사용자를 엄격히 제한합니다. 존중과 배려를 바탕으로 한 커뮤니티를 유지하기 위해 다음과 같은 약관을 적용합니다.
                        
                        1. 불법적인 활동: 불법적인 활동, 포르노그래피, 성적 차별, 혐오 발언, 폭력적인 콘텐츠, 도배 등을 포함한 어떠한 형태의 범죄적이거나 불쾌한 행위도 용납되지 않습니다.
                        
                        2. 상업적 광고 활동: 상업적 광고 목적으로의 홍보 및 판촉 활동은 허용되지 않습니다.
                        
                        3. 사생활 침해: 다른 사용자의 사생활을 침해하거나 불법적으로 개인 정보를 수집하거나 공유하는 행위는 엄격히 금지됩니다.
                        
                        4. 악성 소프트웨어 및 스팸: 악성 소프트웨어의 전파, 스팸 홍보, 사기 행위 등과 같은 악의적인 소프트웨어 사용 또는 홍보는 금지됩니다.
                        
                        5. 운영 정책 준수: 저희 서비스의 운영 정책 및 지침을 준수하지 않는 행위는 엄격히 금지되며, 이에 따른 조치가 취해질 수 있습니다.
                        
                        6. 신고 및 조치: 사용자는 불쾌한 콘텐츠 또는 악의적인 사용자를 발견할 경우 즉시 신고할 수 있으며, 저희는 이를 검토하여 적절한 조치를 취할 것입니다.
                        
                        이 약관을 위반할 경우 계정이 일시적으로 정지되거나 영구적으로 삭제될 수 있습니다. 저희는 모든 사용자가 안전하게 서비스를 이용할 수 있도록 최선을 다할 것을 약속드립니다.
                        """
}
